/*<!---------------------------------------------------------------------------------------------------------|
|------------------------------------------------------------------------------------------------------------|
| NOMBRE    :  DANNY JOSE JIMENEZ GUTIERREZ                                                                  |
| CEDULA    :  16.029.567                                                                                    |
| TELEFONO  :  0424-281-44-55                                                                                |
| CORREO    :  DENNALY88@GMAIL.COM                                                                           |
|------------------------------------------------------------------------------------------------------------|
|  CURSO    : MYSQL                                                                                          |
|  DESARROLLADOR WEB                                                                                         |
|  MIRANDA , CUA  2025                                                                                       |
-------------------------------------------------------------------------------------------------------------|
----------------------------------------------------------------------------------------------------------->*/

/----------------------------------------------------------/
     1. COUNT() (Contar)
/---------------------------------------------------------/

/*Esta función devuelve el número de filas en un conjunto de resultados. Es útil para contar registro*/


SELECT COUNT(*) AS total_ventas
FROM ventas;


/----------------------------------------------------------/
     2. SUM() (Sumar)
/---------------------------------------------------------/

/*Esta función devuelve la suma total de una columna numérica específica. Es útil para calcular totales*/

SELECT SUM(monto) AS total_ingresos
FROM ventas;


/----------------------------------------------------------/
     3. AVG() (Promedio)    
/---------------------------------------------------------/

/*
Calcula el valor promedio (la media) de una columna numérica.
*/

SELECT AVG(nota) FROM calificaciones;



/----------------------------------------------------------/
    4. MAX() (Máximo)
/---------------------------------------------------------/

/*
Devuelve el valor más alto en una columna. Puede usarse con columnas numéricas, de texto o de fecha.
*/

SELECT MAX(salario) AS salario_maximo
FROM empleados; 

/----------------------------------------------------------/
    5. MIN() (Mínimo)
/---------------------------------------------------------/

/*
Devuelve el valor más bajo en una columna. Puede usarse con columnas numéricas, de  
texto o de fecha.
*/

SELECT MIN(salario) AS salario_minimo
FROM empleados;



/*<!---------------------------------------------------------------------------------------------------------|
|------------------------------------------------------------------------------------------------------------|
| NOMBRE    :  DANNY JOSE JIMENEZ GUTIERREZ                                                                  |
| CEDULA    :  16.029.567                                                                                    |
| TELEFONO  :  0424-281-44-55                                                                                |
| CORREO    :  DENNALY88@GMAIL.COM                                                                           |
|------------------------------------------------------------------------------------------------------------|
|  CURSO    : MYSQL                                                                                          |
|  DESARROLLADOR WEB                                                                                         |
|  MIRANDA , CUA  2025                                                                                       |
-------------------------------------------------------------------------------------------------------------|
----------------------------------------------------------------------------------------------------------->*/